Repository: 84000/data-translation-memory
Catalog: toh254-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཆོས་ཀྱི་རྒྱལ་མཚན་གྱི་མདོ་ཐེག་པ་ཆེན་པོའོ། །སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: The Noble Mahāyāna Sūtra of Dharmaketu Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་བཞུགས་ཏེ།
en: The Blessed One was staying in Śrāvastī, in Prince Jeta’s Grove, Anātha­piṇḍada’s park.

source: དེའི་ཚེ་འཁོར་དེར་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་འདུག་པ་སྟན་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དུ་དང་ལྡན་ན་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་བ་ལགས།
en: At that time, a bodhisattva named Dharmaketu who was present in his retinue rose from his seat and addressed this question to the Blessed One: “Blessed One, which are the qualities that bodhisattvas must possess to become unsurpassed, perfect, and completely awakened buddhas quickly?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཅུ་དང་ལྡན་ན་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་རོ། །
en: The Blessed One replied, “Noble child, there are ten qualities that bodhisattvas should possess to become unsurpassed, perfect, and completely awakened buddhas quickly.

source: བཅུ་གང་ཞེ་ན།
en: What are those ten?

source: འདིར་བྱང་ཆུབ་སེམས་དཔའ་དད་པ་དང་ལྡན་པར་བྱ་བ་དང་།
en: They are as follows: “The bodhisattvas have faith.

source: བྱང་ཆུབ་ཀྱི་སེམས་དང་ལྡན་པར་བྱ་བ་དང་།
en: They have bodhicitta.

source: དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་མི་གཏང་བ་དང་།
en: They do not forsake their spiritual mentors.

source: དགོན་པར་བསྟེན་ཅིང་འདུ་འཛི་སྤང་བ་དང་།
en: They dwell in seclusion and abandon worldly distractions.

source: བླ་མ་དང་མཁན་པོའི་གདམས་ངག་ཡོངས་སུ་སྩལ་བ་དང་།
en: They seek out the oral instructions of gurus and preceptors.

source: སྙིང་རྗེ་དང་ལྡན་པ་དང་།
en: They have compassion.

source: མང་དུ་ཐོས་པ་དང་ལྡན་པ་དང་།
en: They are learned in many teachings.

source: ཏིང་ངེ་འཛིན་དང་ལྡན་པ་དང་།
en: They have meditative concentration.

source: ཚུལ་ཁྲིམས་དང་ལྡན་པ་དང་།
en: They have ethical conduct.

source: བརྩོན་འགྲུས་ཕུན་སུམ་ཚོགས་པས་དོན་མ་ལུས་པར་བསྒྲུབ་པའོ། །
en: Through unparalleled joyous effort, they accomplish every one of their aims.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་རྒྱལ་མཚན་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: The Blessed One spoke these words, and the bodhisattva Dharmaketu and all those in that retinue praised what the Blessed One had said.

source: འཕགས་པ་ཆོས་ཀྱི་རྒྱལ་མཚན་གྱི་མདོ་རྫོགས་སོ།​། །​།
en: This concludes the noble “Sūtra of Dharmaketu.”
